/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																				   //
// Author               : pt206																												       //
// Day 				    : 03.06.2019																											   //
// file name            : main.cpp																												   //
//																																				   //
// ------------------------------------------------------------------------------------------------------------------------------------------------//		
// A																																			   //
//              _____           _      _     _ _																								   //
//             /  __ \         | |    | |   (_) |																								   //
//             | /  \/ ___   __| | ___| |    _| |_ ___																							   //
//             | |    / _ \ / _  |/ _ \ |   | | __/ _ )																							   //
//             | \__/\ (_) | (_| |  __/ |___| | ||  __/																							   //
//              \____/\___/ \__,_|\___\_____/_|\__\___|																							   //
//																																				   //
//                                                  F i l e																						   //
//																																				   //
// 4. Написать   программу,   читающую   содержимое   одного   текстового   файла,																   //
// и   записывающую   его   в конец другого текстового файла.																					   //
// Файлы для работы создать самостоятельно.																										   //
//																																				   //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <fstream>

using namespace std;

int main(int argc, char **argv)
{
	//Тоже заранее делаем файл
	{
		char * file1 = "/root/Рабочий\ стол/f1";
		ofstream ofs;
		ofs.open(file1);
		ofs << "Something random text";
		ofs.close();
	}

	string text;
	{
		char * file2 = "/root/Рабочий\ стол/f1";
		ifstream ifs;
		ifs.open(file2);

		ifs.seekg (0, std::ios::end);
		int size = ifs.tellg();
		ifs.seekg(0,ios::beg);
		char * buffer = new char[size];

		ifs.read((char*)buffer, size);
		text = buffer;
		
		ifs.close();
		delete[] buffer;
	}


	{
		char * file3 = "/root/Рабочий\ стол/f2";
		ofstream ofs;

		ofs.open(file3, std::ios::app);
		ofs << text;
		ofs.close();
	}
	return 0;
}