/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																				   //
// Author               : pt206																												       //
// Day 				    : 03.06.2019																											   //
// file name            : main.cpp																												   //
//																																				   //
// ------------------------------------------------------------------------------------------------------------------------------------------------//		
// A																																			   //
//              _____           _      _     _ _																								   //
//             /  __ \         | |    | |   (_) |																								   //
//             | /  \/ ___   __| | ___| |    _| |_ ___																							   //
//             | |    / _ \ / _  |/ _ \ |   | | __/ _ )																							   //
//             | \__/\ (_) | (_| |  __/ |___| | ||  __/																							   //
//              \____/\___/ \__,_|\___\_____/_|\__\___|																							   //
//																																				   //
//                                                  F i l e																						   //
//																																				   //
// 1. Написать программу, читающую последовательность из десяти целых чисел,																	   //
// а затем выводящихих в виде трех столбцов, в первом столбце должны быть выведены восьмеричные значения этих чисел,							   //
// во втором — десятичные, в третьем — шестнадцатеричные.																						   //	
//																																				   //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <fstream>
#include <iomanip>

using namespace std;

void printTabl(const int mode);
void calcMiddle(const string file);

int main(int argc, char **argv)
{
	const int NUMBER_COUNT = 10;
	const int NUMBER_SIZE  = 4;
	const char * file = "/root/Рабочий стол/examp";
	int array[NUMBER_COUNT];

	ifstream ifs;
	ifs.open(file, ios::binary | ios::in);

	for (int i = 0; i < NUMBER_COUNT; i+=5) {
		ifs.read((char*)array, sizeof array);
	}

	for (auto f : array) cout << oct <<  f << "\t" <<  dec << f << "\t" <<  hex << f << endl;
	ifs.close();
	


	return 0;
}


	/* Чтобы сделать стартовы файл
	ofstream ofs;
	ofs.open(file, ios::binary | ios::trunc | ios::out);


	for (int i = 0; i < NUMBER_COUNT; i++) {
		array[i] = i;
	}

	ofs.write((char*)&array, sizeof array);
	ofs.close();

	cout << "############\n";
	for (auto f : array) cout << f << endl;
	cout << "############\n";
	*/


