/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																				   //
// Author               : pt206																												       //
// Day 				    : 03.06.2019																											   //
// file name            : main.cpp																												   //
//																																				   //
// ------------------------------------------------------------------------------------------------------------------------------------------------//		
// A																																			   //
//              _____           _      _     _ _																								   //
//             /  __ \         | |    | |   (_) |																								   //
//             | /  \/ ___   __| | ___| |    _| |_ ___																							   //
//             | |    / _ \ / _  |/ _ \ |   | | __/ _ )																							   //
//             | \__/\ (_) | (_| |  __/ |___| | ||  __/																							   //
//              \____/\___/ \__,_|\___\_____/_|\__\___|																							   //
//																																				   //
//                                                  F i l e																						   //
//																																				   //
// 3. Написать   программу,   читающую   числа   с   плавающей   точкой																			   //
// из   заданного   преподавателем тестового файла, и вычисляющую их среднее арифметическое.													   //
//																																				   //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <fstream>
#include <iomanip>

using namespace std;

void calcMiddle(const string file);

int main(int argc, char **argv)
{
	
	
	char * file = "/root/Рабочий\ стол/summ";
	/*Чтобы сделать файл
	float array[5];
	
	for (int i = 0; i < 5; i++) {
		array[i] = (float)i*i*1.1;
		cout << array[i] << endl;
	}
	
	
	ofstream ofs;
	ofs.open(file, ios::binary | ios::trunc | ios::out);
	ofs.write((char*)array, sizeof array);
	ofs.close();
	*/

	calcMiddle((string)file);
	return 0;
}

void calcMiddle(const string file) {

	const int SIZE = 5;
	float array[SIZE];
	ifstream ifs;
	ifs.open(file, ios::binary | ios::in);

	ifs.seekg (0, std::ios::end);
	int size = ifs.tellg();
	ifs.seekg(0,ios::beg);

	ifs.read((char*)array, 20);

	ifs.close();

	float summ = 0;
	for (int i = 0; i < SIZE; i++) {
		cout << array[i] << endl;
		summ +=array[i];
	}
	cout << summ/SIZE << endl;
}
