/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//																																				   //
// Author               : pt206																												       //
// Day 				    : 03.06.2019																											   //
// file name            : main.cpp																												   //
//																																				   //
// ------------------------------------------------------------------------------------------------------------------------------------------------//		
// A																																			   //
//              _____           _      _     _ _																								   //
//             /  __ \         | |    | |   (_) |																								   //
//             | /  \/ ___   __| | ___| |    _| |_ ___																							   //
//             | |    / _ \ / _  |/ _ \ |   | | __/ _ )																							   //
//             | \__/\ (_) | (_| |  __/ |___| | ||  __/																							   //
//              \____/\___/ \__,_|\___\_____/_|\__\___|																							   //
//																																				   //
//                                                  F i l e																						   //
//																																				   //
// 2. Написать   функцию   для   вывода   таблицы   умножения   заданной   системы   счисления.													   //
// Систему счисления   задавать   в   качестве   параметра   функции.																			   //
// Обеспечить   поддержку   восьмеричной, десятичной и шестнадцатеричной систем.																   //
//																																				   //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <fstream>
#include <iomanip>

using namespace std;

void printTabl(const int mode);

int main(int argc, char **argv)
{
	printTabl(5);
	printTabl(8);
	printTabl(10);
	printTabl(16);

	return 0;
}

void printTabl(const int mode) {

	if (mode == 8) {
		cout << "Режим " << dec << mode << endl;
		for (int i = 0; i < mode; i++) {
			for (int j = 0; j < mode; j++) {
				cout << oct << setw(4) << (i+1)*(j+1);
			}
			cout << endl;
		}
		return;
	}
	if (mode == 10) {
		cout << "Режим " << dec << mode << endl;
		for (int i = 0; i < mode; i++) {
			for (int j = 0; j < mode; j++) {
				cout << dec << setw(4) << (i+1)*(j+1);
			}
			cout << endl;
		}
		return;
	}
	if (mode == 16) {
		cout << "Режим " << dec  << mode << endl;
		for (int i = 0; i < mode; i++) {
			for (int j = 0; j < mode; j++) {
				cout << hex << setw(4) << (i+1)*(j+1);
			}
			cout << endl;
		}
		return;
	}
	cout << "unknown mode\n";
	return;
}
